{
  "characters": [
    {
      "name": "Oola",
      "gender": "Female",
      "height": 160,
      "mass": 52,
      "homeworld": "Ryloth",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218680-46-Oola.jpg?resize=1240,1240&w=300",
      "description": "Respect Oola, one of the very rare roles for a woman of color in the original trilogy. Rejecting Jabba’s disgusting advances, her expressions speak volumes even though she’s doomed to die. It doesn’t help that she’s the pretty woman in the palace who isn’t the heroine of the series. (Leia gets to resist Jabba and live.) Books and comics in the “expanded universe” gave Oola a real story, but the Return of the Jedi Special Edition extended her torment with new shots featuring original actress Femi Taylor. RF"
    },
    {
      "name": "Jango Fett",
      "gender": "Human",
      "height": 183,
      "mass": 79,
      "homeworld": "Concord Dawn",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218677-43-jango-fett-48836392-a75d-46cd-9fa5-0e6927eae162.jpg?resize=1240,1240&w=300",
      "description": "He’s “just a simple man trying to make my way in the universe,” but Jango Fett is legion — literally. Through extensive cloning, the bounty hunter behind the blue Mandalorian armor is the basis not only for his better-known “son” Boba Fett, but for each and every trooper who gives Attack of the Clones its title. From his knock-down drag-out brawl with Obi-Wan to their high-speed asteroid-field chase to his decapitation by Mace Windu’s blade, he’s a key part of the film’s best action sequences. Kudos to Kiwi actor Temuera Morrison, who gives the character rough-hewn gangster gravitas. STC"
    },
    {
      "name": "Padmé Amidala",
      "gender": "Female",
      "height": 165,
      "mass": 55,
      "homeworld": "Naboo",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218676-42-Padme-Amidala.jpg?resize=1240,1240&w=300",
      "description": "Almost unmentioned in the original trilogy, Luke and Leia’s mom plays a major role in the prequels: going undercover as her own handmaiden in The Phantom Menace, fighting in a gladiatorial arena in Attack of the Clones, and trying to save her husband’s soul in Revenge of the Sith. She’s right there with the boys, instead of worriedly wringing her hands back home. (Okay, maybe there’s a little of that in Sith.) And as an early supporter of Senator Palpatine’s plans, Padmé Amidala helps set in motion everything that befalls her, making her a lot like her son: a hero whose impulse to help sometimes worsens things. NM"
    },
    {
      "name": "Sebulba",
      "gender": "Male",
      "height": 112,
      "mass": 45,
      "homeworld": "Malastare",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218675-41-Sebulba.jpg?resize=1240,1240&w=300",
      "description": "Looking like a creature that might have resulted from a three-way between a camel, the Cloverfield monster, and Amelia Earhart, this villainous Dug is The Phantom Menace‘s most fun cartoon monstrosity. A former slave who emancipated himself on the strength of his pod-racing skills, Sebulba is the Wile E. Coyote to Anakin Skywalker’s Roadrunner. “Yoka to Bantha poodoo!” DE"
    },
    {
      "name": "Admiral Motti",
      "gender": "Male",
      "height": 170,
      "mass": 70,
      "homeworld": "Seswenna",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218674-40-admiral-motti-701fbb2f-6df1-450e-af28-715e3cfe2e65.jpg?resize=1240,1240&w=300",
      "description": "For a guy sharp enough to work his way up to the position of admiral in the Imperial Fleet, you’d think Conan Antonio Motti would be bright enough to know that you don’t shit-talk Darth Vader to his metal face. His screen time is short, but he’s a pivotal character thanks to the way Darth totally posterizes him in A New Hope. Choking Motti from afar after he gets snippy questioning the power of the Force, Vader delivers a killer one-liner: “I find your lack of faith disturbing.” Cut scene we’d love to see: Motti then going to Human Resources to report an unsafe work environment. TG"
    },
    {
      "name": "Q’ira",
      "gender": "Female",
      "height": 158,
      "mass": 50,
      "homeworld": "Corellia",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/emilia-clarke-solo-a-star-wars-story-85c0e6d8-9f9d-49c1-8d31-9df375f1b904.jpg?resize=1240,1240&w=300",
      "description": "Growing up in the same Corellian hellhole as Solo‘s title character, Q’ira (played by Game of Thrones’ khaleesi, Emilia Clarke) is cut from the same cloth as her long-lost love interest. But there’s a big difference: She never really escaped the underworld, and has had to navigate life in the crime syndicate for years. This harsh education has made her a hypercompetent fighter and negotiator, able to save the lives of Han and Lando, kick ass in a swordfight and successfully bluff her way into becoming the the underboss of Crimson Dawn godfather Darth Maul (!). Not bad for a kid from the mean streets. STC"
    },
    {
      "name": "Uncle Owen",
      "gender": "Male",
      "height": 170,
      "mass": 73,
      "homeworld": "Tatooine",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218673-39-45-Uncle-Owen.jpg?resize=1240,1240&w=300",
      "description": "Poor Owen Lars. All he ever wanted was a quiet life on Tatooine, farming moisture. But just because his widowed father happened to marry the mother of Darth freakin’ Vader, he was plagued by Jedi Knights, Tusken Raiders, and Imperial Stormtroopers. First introduced in A New Hope as Luke’s strict, humorless guardian, Uncle Owen is actually as much of a tragic figure as anybody in the franchise. He tries his best to keep his step-nephew safe from the violence and turmoil shattering the galaxy. He’s paid back in sass, disobedience, and an early grave. NM"
    },
    {
      "name": "Admiral Firmus Piett",
      "gender": "Male",
      "height": 173,
      "mass": 66,
      "homeworld": "Axxila",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218786-33.jpg?resize=1240,1240&w=300",
      "description": "From a certain point of view, The Empire Strikes Back can be seen as a dark workplace comedy in which Imperial officer Firmus Piett tries to do just enough right so that he’s not killed by Darth Vader. (Just ask Admiral Ozzel and Captain Needa, who both get the Dark-Side choke of death during the movie.) Played by character actor Kenneth Colley, Piett was a fan favorite because he seemed to embody the helpless walking-on-eggshells mentality a lot of us have dealt with when we’re working for a real diva of a boss. TG"
    },
    {
      "name": "Wedge Antilles",
      "gender": "Male",
      "height": 170,
      "mass": 68,
      "homeworld": "Corellia",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218670-37-Wedge-Antilles.jpg?resize=1240,1240&w=300",
      "description": "Amid all the praise for Luke, Han and the rest of the Rebel Alliance, Wedge has never gotten his due, serving as a pilot in all three critical battles during the original trilogy — the two Death Stars and the AT-AT showdown on Hoth — and acquitting himself heroically every time. If the universe had an award comparable to the NBA’s Sixth Man of the Year — i.e. the best player off the bench — the man would have won it, doing all the hard work for the Rebellion but never enjoying the spotlight. Maybe that’s why the actor who played him, Denis Lawson, turned down a part in The Force Awakens: He’s tired of being a glorified extra. TG"
    },
    {
      "name": "Admiral Holdo",
      "gender": "Female",
      "height": 174,
      "mass": 64,
      "homeworld": "Gatalenta",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/tmp_cv7ql9_7dec4b0840814607_thelastjedi5a204fd35aa66-bab6ad99-47c0-4f4a-8bce-63b9584ebeb5.jpg?resize=1240,1240&w=300",
      "description": "A long time ago – well, 2017 – the pop-culture galaxy was governed by two powerful forces: Star Wars fever and the Dernaissance. Vice Admiral Holdo is the chosen one, bringing balance to these equal and opposite phenomena by placing the great Laura Dern right at the center of The Last Jedi. Thrust into the top spot in the Resistance fleet (Admiral Ackbar, R.I.P.), this lavender-haired leader oversaw the rebels’ successful slow-motion escape from Kylo Ren and company, fending off a challenge from hotheaded Poe Dameron in the process. Holdo also sacrificed her own life to buy her friends more time by ramming her ship into the First Order fleet at light speed, and helped create one of the biggest “holy shit” moments in the franchise’s history. STC"
    },
    {
      "name": "IG-88",
      "gender": "Male",
      "height": 196,
      "mass": 115,
      "homeworld": "Holowan Laboratories",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218669-36-IG-88.jpg?resize=1240,1240&w=300",
      "description": "“Bounty hunters. We don’t need that scum.” Oh, how wrong you are, Admiral Piett. What’s arguably the coolest shot of The Empire Strikes Back involves Darth Vader commissioning a group of fierce weirdos to find the Millennium Falcon — and the best non-Boba Fett bount hunter is IG-88, a chrome droid with a head like a menacing coffee percolator. One of the more Buck Rogers-y creatures in all of the series, the lean and tall killer bot suggests a world where machines aren’t just baddies; they’re also looking out for themselves. JH"
    },
    {
      "name": "EV-9D9",
      "gender": "Female",
      "height": 190,
      "mass": 90,
      "homeworld": "MerenData",
      "image": "https://www.rollingstone.com/movies/movie-lists/50-best-star-wars-characters-of-all-time-145533/oola-156492/data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "description": "Working for Jabba probably sucks, which explains EV-9D9’s utterly cruddy attitude in Return of the Jedi (that’s him in the center of the pic). Supervising the mechanical-help deployment in Jabba’s lair and sail barge, he’s surely always in need of fresh hires, considering that his boss has an irritating habit of disintegrating droids that displease him. Of the robots we encounter in the Star Wars universe, he’s probably the surliest, not caring one bit about Threepio’s friendly chitchat or putting up with Artoo’s feistiness. (The character was voiced by Return director Richard Marquand, who died four years after the film’s release.) TG"
    },
    {
      "name": "Mon Mothma",
      "gender": "Female",
      "height": 173,
      "mass": 65,
      "homeworld": "Chandrila",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218666-32-Mon-Mothma.jpg?resize=1240,1240&w=300",
      "description": "A key to Star Wars‘ success is its timelessness, but take one look at Caroline Blakiston’s Eighties sci-fi hair and gown as Mom Mothma in Return of the Jedi and you’d think she just took off her cushioned headphones playing Journey before walking on set. The Rebel Alliance bigwig delivers one of the biggest guilt-trips in all of the series — “Many Bothans died to bring us this information” — which doubles as a rebuke to audience members who thought all this blaster fire was just fun-and-games. A younger version played by Genevieve O’Reilly was seen (but not heard) in Revenge of the Sith, wearing a metal headpiece that echoes Princess Leia’s hair buns. JH"
    },
    {
      "name": "Count Dooku",
      "gender": "Male",
      "height": 196,
      "mass": 86,
      "homeworld": "Serenno",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/dooku.jpg?resize=1240,1240&w=300",
      "description": "Forgive Count Dooku’s dismal name; even his Sith alias, Darth Tyranus, inspires shrugs more than fear. But embrace Christopher Lee, who brings this master swordsman of the one-percent to life with the technicolor gravitas of Hammer horror. Dooku’s best machinations as a Separatist leader take place off screen; Lee’s Middle-Earth training means his lightsaber skills, however, are devastating. The Count’s final battle with Anakin and Obi-Wan is among the best action sequences of the Prequels, and his death — a vicious execution at the hands of greasy-haired Anakin — is a key moment in the young Jedi’s fall to the dark side. RF"
    },
    {
      "name": "Nien Nunb",
      "gender": "Male",
      "height": 160,
      "mass": 58,
      "homeworld": "Sullust",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218657-28-Nien-Nunb.jpg?resize=1240,1240&w=300",
      "description": "When Han gave Lando the keys to the Millennium Falcon for Return of the Jedi‘s Battle of Endor, the Rebel Alliance couldn’t assign just any old co-pilot. Not enormous and furry like Chewie, Nein Numb was still an instantly likable creature, whose optimistic chortle is one of the more exuberant evocations of joy in the entire series. The current (canonical) Princess Leia comics shows how key he was in rescuing surviving Alderaanians from the Empire after the Battle of Yavin. Alas, the Sullustan’s curious name has a rather mundane origin; his package in the creature shop was labelled “Number Nine.” JH"
    },
    {
      "name": "Lobot",
      "gender": "Male",
      "height": 175,
      "mass": 75,
      "homeworld": "Bespin",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218656-27-Lobot.jpg?resize=1240,1240&w=300",
      "description": "Think you’re addicted to technology? Checking Instagram every five minutes is nothing compared to Lando Calrissian’s administrative aid in Cloud City. His headphones aren’t downloading podcasts, they’re a port connecting his mind with the central computer system. His name may be a cheap pun on “lobotomy,” but even with no lines each cutaway to the intense, bald systems chief in The Empire Strikes Back makes for a memorable image. His “it’s all good” spin-n-point move when Lando and Han embrace is only topped by his eyes-front awakening when his boss sends him an alert from his digital watch. JH"
    },
    {
      "name": "Ponda Baba",
      "gender": "Male",
      "height": 185,
      "mass": 77,
      "homeworld": "Ando",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218655-26-Ponda-Baba.jpg?resize=1240,1240&w=300",
      "description": "Long known as “Walrus Face” to fans whose franchise knowledge was defined by Kenner’s original action-figure line, this aggressive and toothy Cantina denizen illustrates the very relatable dangers of that backwater post Mos Eisley. Darth Vader and Sandpeople are freaky, sure, and imposing in an outlandish way. But a drunk bruiser in a bar, slurring illegible threats? We’ve all run afoul of him. If only we all had a lightsaber-wielding friend to sever that jerk’s arm and end the fight before the bartender has to call the cops. RF"
    },
    {
      "name": "Max Rebo",
      "gender": "Male",
      "height": 150,
      "mass": 115,
      "homeworld": "Orto",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218653-25-Max-Rebo.jpg?resize=1240,1240&w=300",
      "description": "Most of the hangers-on at Jabba’s palace ooze evil, but for the musicians … well, a gig’s a gig, right? Keeping things lively in the sadistic gangster’s HQ is the toe-tappin “jizz” music of the Max Rebo Band. Sure, the grooves urge the repulsive Hutt to paw at his doomed slave girl Oola, but the blue, elephantine Rebo simply keeps his head down and jams on his parabolic keyboard. “I just work here,” the cutaways in Return of the Jedi imply, and the adorable trunk, chubby arms and tasty licks are enough to earn him a pass. JH"
    },
    {
      "name": "Salacious B. Crumb",
      "gender": "Male",
      "height": 70,
      "mass": 9,
      "homeworld": "Kowak",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218652-24-Crumb.jpg?resize=1240,1240&w=300",
      "description": "The best audience you could ever hope for on Tatooine, Crumb was the perpetually cackling critter by Jabba the Hutt’s side, always laughing snidely along with his master’s latest sadistic comment. There are plenty of noxious characters in the villain’s lair, but Salacious was easily the most punch-able — whether it was the way he leered at a half-naked Leia in her slave-girl outfit or dug into poor Threepio’s eye during the battle on the sail barge. Sadly, we were deprived of the pleasure of watching that loathsome lizard-like creature die in excruciating agony: He had it coming. TG"
    },
    {
      "name": "Enfys Nest",
      "gender": "Female",
      "height": 167,
      "mass": 55,
      "homeworld": "n/a",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/enfys-nest.jpg?resize=1240,1240&w=300",
      "description": "Looking like a cross between Kylo Ren and a crazed buzzard, the black-clad marauder called Enfys Nest is a terrifying presence as Solo picks up steam, leading a clan of Cloud-Rider sky pirates in daring, deadly raids against Han’s criminal crew. But this fascinating character is more than he – or rather, she  – seems at first glance. Nest is actually a teenage girl (played by newcomer Erin Kellyman) who’s assembled her own rebel alliance of aliens, all of whom have been victimized by the crime syndicates Solo and his comrades have been forced to serve. Under her leadership, they’ve started to fight back. Han’s decision to help her out rather than sell her out is a major step on his road to the Rebellion – and, hopefully, just our first glimpse of an incredibly cool new character. STC"
    },
    {
      "name": "Figrin D’an Nodes",
      "gender": "Male",
      "height": "n/a",
      "mass": "n/a",
      "homeworld": "Bith",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218651-23-modal-nodes-235dec30-33ac-4387-a698-8368a494a462.jpg?resize=1240,1240&w=300",
      "description": "Even “a wretched hive of scum and villainy” needs some hot tunes. This bulb-headed, horn-blowing sextet brightened up the dingy Mos Eisley Cantina, playing a catchy song that later became a Billboard chart hit (courtesy of the disco act Meco). The expanded Star Wars universe builds out the backstory of the Modal Notes — did you know they’re all Biths from the planet Clak’dor VII? — but in the movie all they have to do is look weird and sound jazzy. Because for all the franchise’s fancy special effects, a lot of its visual appeal still comes from actors in rubber suits, flailing about. NM"
    },
    {
      "name": "Wicket W. Warrick",
      "gender": "Male",
      "height": 80,
      "mass": 40,
      "homeworld": "Endor",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218649-22-wicket-w-warrick-44a6e31b-87cb-47a9-bf4e-e87d34814eb0.jpg?resize=1240,1240&w=300",
      "description": "12-year old Warwick Davis charmed George Lucas enough to step up from Ewok extra to featured status when original actor Kenny Baker fell ill before shooting a key scene with Carrie Fisher. So Davis, as the furry scout Wicket, becomes our introduction to the inhabitants of the forest moon of Endor. The clever native in a leather hoodie wasn’t a tribal leader or even an ambitious warrior; he’s just your typical Everyewok, saving his best moves for cozying up to Han Solo during tender moments. But his encounter with the Rebel officers set up an alliance that would help destroy the Empire. Respect, Wicket. RF"
    },
    {
      "name": "Poe Dameron",
      "gender": "Male",
      "height": 172,
      "mass": 80,
      "homeworld": "Yavin 4",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/star-wars-7-bb-8-with-poe-dameron-e167e5da-859b-4944-a342-5d0e45fc0b3e.jpg?resize=1240,1240&w=300",
      "description": "Hero, heartthrob, ace fighter pilot and half of the big-screen’s greatest bromance in years: Poe Dameron is all these things and more. The Resistance’s best X-wing pilot is played by none other than Llewyn Davis himself, Oscar Isaac, and kicks off the movie by defying Kylo Ren and conducting a daring escape. He’s the kind of guy who won’t just save his friend’s life; he’ll also give him the badass leather jacket right off his back. Don’t tell us that pat on the shoulder didn’t launch a thousand fanfics. STC"
    },
    {
      "name": "General Grievous",
      "gender": "Male",
      "height": 216,
      "mass": 159,
      "homeworld": "Kaleesh",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218646-21-general-grievous-225c2125-ffc7-45ba-8dbb-2338853df6ca.jpg?resize=1240,1240&w=300",
      "description": "His name sounds like a Victorian medical condition, but this evil cyborg one of the more complex villains in Revenge of the Sith. Though mostly robotic, there’s just enough failing organic matter in this bad guy to keep him hunched over and hacking. But when it’s time to face-off against Obi-Wan he shakes off his cloak to reveal an extra set of arms and a knack for wielding lightsabers. (And spinning them like brightly-lit windmills.) Unable to best him using laser swords, Kenobi tears open Grievous’ chest to fire blasters at his shriveled internal organs until fire spews from his eyes. JH"
    },
    {
      "name": "Qui-Gon Jinn",
      "gender": "Male",
      "height": 193,
      "mass": 88,
      "homeworld": "Coruscant",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218643-20-jinn-0a7fb237-3cff-45bc-b27e-e26accc8f921.jpg?resize=1240,1240&w=300",
      "description": "All the scorn heaped on The Phantom Menace obscures how good Liam Neeson is as an honorable Jedi knight who mentors young Obi-Wan (Ewan McGregor) in the ways of the Force. In Qui-Gon Jinn, we can see the wise-elder warrior that Kenobi would grow to become, and Neeson (who had yet to make the transition to avenging-angel action star) brought just the right amount of Zen gravitas to his ass-kicking role. Although the prequels were about Anakin’s character arc, the first installment really belongs to this character, who’s trying to maintain a fragile peace across the galaxy while unseen forces are conspiring to tear it apart. That’s what makes his death at the hands of Darth Maul especially tragic: It’s not just Qui-Gon who’s dying but also his era’s sense of nobility. TG"
    },
    {
      "name": "Bib Fortuna",
      "gender": "Male",
      "height": 200,
      "mass": 100,
      "homeworld": "Ryloth",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218639-19-bib_fortuna.jpg?resize=1240,1240&w=300",
      "description": "Jabba the Hutt’s right-hand man may have been no match for Jedi mind tricks, but when the Rebels weren’t setting up a complex prison break for Han Solo, the sniveling Twi’lek did an ace job of keeping the debauchery and illegality of the Palace running smoothly. He had the good fortune to have his lekku (or “brain-tail”) dip under his chin like a bib, a wonderful coincidence considering his given name. And being the obsequious slime that he was, he somehow survived the battle on Jabba’s skiff near the Great Pit of Carcoon. JH"
    },
    {
      "name": "Admiral Ackbar",
      "gender": "Male",
      "height": 180,
      "mass": 75,
      "homeworld": "Mon Cala",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218635-18-ackbar-b6dfad9a-3296-4a9e-ba4a-16b756d7b962.jpg?resize=1240,1240&w=300",
      "description": "With salmon-colored skin, eyes parted to the far sides of his face, and an eminently hook-able mouth, Admiral Ackbar is basically a freshwater fish with arms and legs. But he served with enough distinction to lead the Rebel Alliance into battle in Return of the Jedi, commanding the mission to destroy the Death Star II (a much more strategically complicated affair than destroying the original Death Star). Still, it’s three words — “It’s a trap!” — that led the gill-pocked humanoid to Star Wars immortality. “It’s a trap!” became a Photoshop-friendly meme, and a perhaps inevitable Family Guy episode. Ackbar’s popularity exploded long after Return of the Jedi was released, with appearances in books and animated spin-offs, and a spot in The Force Awakens. ST"
    },
    {
      "name": "Finn",
      "gender": "Male",
      "height": 178,
      "mass": 73,
      "homeworld": "n/a",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/finn-main_952e10d2-db8b1a05-f380-4225-8ca2-4580b3976369.jpg?resize=1240,1240&w=300",
      "description": "He’s the stormtrooper formerly known as FN-2187 who told the First Order to shove it; one-half of a beloved bromance (Poe-mance?) with ace pilot Poe Dameron; a potential love interest for not one but two leading ladies (Rey in The Force Awakens and Rose in The Last Jedi); and no slouch with a lightsaber when push comes to shove. He’s Finn, and as portrayed by English actor John Boyega, he’s the idealistic and entertaining heart of the Abrams/Johnson/Abrams sequel trilogy. Whether you like him flirting, fighting, fumbling or flushing Captain Phasma down a garbage chute, he makes every second of screen time a blast – all of this in a role that defies all previous Star Wars archetypes. Not to mention that he looks damn good in Poe’s bomber jacket. STC"
    },
    {
      "name": "Chirrut Îmwe",
      "gender": "Male",
      "height": 173,
      "mass": 67,
      "homeworld": "Jedha",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/11-33743d71-d689-44a3-9886-4523e804a173.jpg?resize=1240,1240&w=300",
      "description": "“The Force is with me, and I am with the Force” – this mantra-like inversion of the franchise’s usual catchphrase, “May the Force be with you,” is enough to earn the blind mystic Chirrut Îmwe a place in the heart of any fan who needs a uniquely Star Wars-ian self-affirmation. But the former guard of an ancient Jedi temple is more than just a life coach from a galaxy far, far away – he’s a blind martial artist with Daredevil-esque fighting skills, a man who can school a squad of stormtroopers while armed only with a staff and an unwavering sense of belief. (The fact that his fellow badass Baze Malbus has his back is, of course, a bonus.) He’s the living embodiment of the maxim “Speak softly and carry a big stick.” And while his sacrifice at the end of Rogue One means we’ll never get to see what he could do with a Darth Maul–style double-bladed lightsaber in his hand, hey, a fan can dream.  STC"
    },
    {
      "name": "Darth Sidious",
      "gender": "Male",
      "height": 178,
      "mass": 75,
      "homeworld": "Naboo",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218611-17-Emp.jpg?resize=1240,1240&w=300",
      "description": "The one story the prequels tell particularly well doesn’t really involve the corruption of Anakin Skywalker; rather, it’s the one about how the shadowy leader of a religious cult dismantled the republic from within. Senator Sheev Palpatine, a.k.a. “Darth Sidious,” only registers in the original trilogy as “Darth Vader’s boss,” but in Phantom through Sith he’s the evil no one recognizes until it’s too late. He starts out as a deceptively conscientious politician, who then provokes a war, convinces his colleagues to build him a clone army, gets himself named Supreme Chancellor as an emergency measure, and forges an Empire — all legally. In one of the most loaded images of the whole series, Palpatine flings congressional box-seats at Yoda, showing how he uses democracy as a weapon while simultaneously destroying it. NM"
    },
    {
      "name": "Mace Windu",
      "gender": "Male",
      "height": 192,
      "mass": 90,
      "homeworld": "Haruun Kal",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218612-16-Windu-2.jpg?resize=1240,1240&w=300",
      "description": "As portrayed by Samuel L. Jackson (perhaps the only actor capable of making a purple light-saber look like the baddest weapon in the galaxy), Windu is a stoic fixture of the prequel trilogy, representing the very best of what those movies had to offer. Among the precious few Jedi Masters of the High Council who possessed the wisdom and courage to distrust Senator Palpatine, he plays an instrumental role in each of his three episodes, from identifying Anakin’s destiny in The Phanton Menace to sealing the future Sith Lord’s fate in Revenge of the Sith. The only way that Windu could have been cooler is if Tupac Shakur had been cast in the role. DE"
    },
    {
      "name": "Wilhuff Tarkin",
      "gender": "Male",
      "height": 182,
      "mass": 73,
      "homeworld": "Eriadu",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218608-15-Tarkin.jpg?resize=1240,1240&w=300",
      "description": "Based solely on the evidence of A New Hope and Rogue One, you’d think Grand Moff Tarkin was the story’s central villain, Darth Vader merely serving as the Oddjob to his Goldfinger. Although Lucas mostly cast unknowns for his sci-fi epic, he chose beloved Hammer Films regular Peter Cushing to play the ramrod character – a wise move. The actor’s refined manner and elegant features (that prominent nose, those jutting cheekbones) make him ideal to portray a man who could both match wits with Princess Leia and treat everyone around him with just the right air of English condescension. Tarkin always carried himself with a confident, slightly smug regal posture … right up until the Rebellion destroyed him right along with his beloved Death Star. TG"
    },
    {
      "name": "Chewbacca",
      "gender": "Male",
      "height": 250,
      "mass": 112,
      "homeworld": "Kashyyyk",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218604-14-Chew.jpg?resize=1240,1240&w=300",
      "description": "The quintessential loyal buddy and irascible sidekick, Chewbacca is the Wookie you want next to you in the foxhole — or, more likely, as your copilot in the Millennium Falcon. The fact that no one in the audience knew what Chewie was ever saying was part of the character’s appeal: Everybody in the Star Wars universe understood his moans and growls, which helped make the movies seem exotic, multicultural and inclusive in a deeply comforting way. Of course, the irony was that the franchise’s tallest, most fearsome wild animal was, in actuality, the biggest softie at heart. It’s his anguished cry when Han Solo gets put into carbonite that makes that indelible sequence from The Empire Strikes Back so gut-wrenching: He’s losing his best friend, and you feel his pain. TG"
    },
    {
      "name": "Jabba the Hut",
      "gender": "Male",
      "height": 390,
      "mass": 1358,
      "homeworld": "Nal Hutta",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218603-13-jabba-c6baa8b5-e9c6-49cb-af0c-51d9e2461489.jpg?resize=1240,1240&w=300",
      "description": "This repulsive, slovenly space slug whose response to mortal terror is a cold, deep laugh is, without a doubt, the finest Star Wars portrait of the id. Jabba’s Palace, a den of sin and sadism, is a wailin’ time for those lucky enough to be in the gangster’s good graces. But its endless party is powered by a Caligula-like cycle of mania in which prized courtesans are fed to monstrous pit-dwelling beasts as an after-dinner entertainment; that he meets his end via the very chains he uses for his concubines is justice. Whether you prefer the original-recipe Muppet-on-acid version or the New Hope new edition’s extra-crispy CGI creature, you have to admire his dedication to being his true, absolutely horrendous self.  JH"
    },
    {
      "name": "Greedo",
      "gender": "Male",
      "height": 174,
      "mass": 70,
      "homeworld": "Tatooine",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218601-12-greedo-8b70aad0-a812-41f8-a3fc-ed4044347a24.jpg?resize=1240,1240&w=300",
      "description": "Poor Greedo. No matter which way the “Han shot first” controversy plays out, the bug-eyed, green-scaled Rodian bounty hunter looks bad. In the original Star Wars, when Jabba’s henchman confronts Han over debts owed, he’s the classic talking killer, yammering threats long enough for his adversary to quietly unholster his blaster and gun him down. In the 1997 special edition, Greedo shoots first from across a small table and misses to the right by half a foot. Either way, his ineptitude at Mos Eisley helps set a heroic course for a fellow smuggler turned hero of the rebellion. But the controversy over his death has made him immortal. ST"
    },
    {
      "name": "K-2SO",
      "gender": "Male",
      "height": 216,
      "mass": 250,
      "homeworld": "Vulpter",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/static1squarespace-307b0d03-c463-4fca-a9fc-dcff6fa23849.jpg?resize=1240,1240&w=300",
      "description": "He’s the towering Imperial security guard with a Rebel-reprogrammed heart of gold, and the robot who stole every Rogue One scene he was in. Voiced by Alan Tudyk – no stranger to space operas, thanks to his role in Joss Whedon’s Firefly/Serenity saga – K-2SO combined the intimidating size and strength of Chewbacca with the very English pessimism of C-3PO. And in terms of Star Wars sidekicks, the dry-witted droid could stand proudly alongside either of those legends. Sadly, his sacrifice at the film’s end so that his human allies Cassian Andor and Jyn Erso could steal the Death Star plans means his star burned bright, but all too briefly. STC"
    },
    {
      "name": "Lando Calrissian",
      "gender": "Male",
      "height": 177,
      "mass": 79,
      "homeworld": "Socorro",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218596-9-Lando.jpg?resize=1240,1240&w=300",
      "description": "As played by Billy Dee Williams, Lando is a suaver Han Solo. Both are rogues, gamblers and guns-for-hire who are philosophically inclined to stay out of galactic conflict unless the price is right. But Han doesn’t trust his old buddy, likely for the same reasons other might not trust him: He mostly acts out of self-interest, not a sense of cosmic justice. Sure enough, Darth Vader gets to Lando first in The Empire Strikes Back and he spends the rest of the movie — and Return of the Jedi — heroically redeeming himself. But the man is cool even at his most treacherous: The silk shirt, the matching cape, the easy smile. Plus Cloud City looks fly. He can’t be blamed for wanting to hold onto it. ST"
    },
    {
      "name": "Kylo Ren",
      "gender": "Male",
      "height": 185,
      "mass": 89,
      "homeworld": "Chandrila",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/kylo-ren_fa163069-3dbaebc4-cc90-416a-8e13-24204ceb753a.jpg?resize=1240,1240&w=300",
      "description": [
        "What happens when you have the power of the Dark Side but lack the self-confidence to properly wield it? You get Kylo Ren, the masked menace with the fiery red lightsaber who serves as The Force Awakens‘ main antagonist. Fueled by the off-kilter intensity of actor Adam Driver, the Star Wars Universe’s new Dark Lord is the emo missing link between Hayden Christen’s petulant Anakin and James Earl Jones’s implacable Darth Vader. He’s strong enough to stop blaster bolts in mid-air (and to kill his own father) but still prone to temper tantrums that leave his underlings running for cover. A fascinating study in contradictions. STC",
        ""
      ]
    },
    {
      "name": "C-3PO",
      "gender": "Male",
      "height": 171,
      "mass": 75,
      "homeworld": "Tatooine",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218599-11-C-3PO.jpg?resize=1240,1240&w=300",
      "description": "Boasting that he is “fluent in over six million forms of communication” (even though the only language you ever hear him speak is overly affected stage British), the protocol droid that Anakin Skywalker fashioned from rusted Tatooine junk immediately assured his place in Star Wars history: He’s the very first character to appear onscreen in A New Hope. A constant staple of George Lucas’ space saga ever since, the metal worrywart jerks around the galaxy like a robot Woody Allen (“We’re doomed! We’ll all be destroyed for sure”). But that human element is precisely what’s made Threepio such an inextricable part of the franchise, the droid’s pristine moral compass forever imbuing the Star Wars movies with their vivid sense of life. DE"
    },
    {
      "name": "Darth Maul",
      "gender": "Male",
      "height": 175,
      "mass": 73,
      "homeworld": "Dathomir",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218597-10-darth-maul-f7404aae-41a5-46bf-8422-6cedebde95d8.jpg?resize=1240,1240&w=300",
      "description": "Real talk: Darth Maul was a pioneer. A man of few words, the Sith Lord with the Rorschach ink blot of a face was the first guy to break the mold on light-sabers, his double-bladed weapon paving the way for Kylo Ren’s cross-sword beam in The Force Awakens. Even more importantly, he also inspired millions of Star Wars fans to ignore the fact that the most anticipated movie of all time was borderline unwatchable. Refreshingly comfortable in his own skin for a series in which the villains are so often hiding their face or cloaking their true intentions, Darth Maul radiates pure evil through his jaundiced yellow eyeballs; George Lucas has described the big bad of The Phantom Menace as “a figure from one of his darkest nightmares.” (Which kind of makes you wonder where Jar Jar Binks came from.) DE"
    },
    {
      "name": "BB-8",
      "gender": "Male",
      "height": 67,
      "mass": 18,
      "homeworld": "Hosnian Prime",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/bb8.jpg?resize=1240,1240&w=300",
      "description": "The rolling droid who accompanies the human adventurers of The Force Awakens manages to make metal seem cuddly, earning him (it?) insta-fan-favorite status – especially with the franchise’s youngest viewers. Unlike past kiddie characters like Jar-Jar Binks, however, our spherical hero has great comic timing; the mechanical thumbs-up he shoots at Rey when he helps the ex-stormtrooper gets one of the movie’s biggest laughs. Which shouldn’t come as a huge surprise: Comedians Bill Hader and Ben Schwartz provided the digitized “voice” that brought director J.J. Abrams and special-effects artist Neal Scanlan’s creation to life. STC"
    },
    {
      "name": "Obi-Wan Kenobi",
      "gender": "Male",
      "height": 182,
      "mass": 81,
      "homeworld": "Stewjon",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/obi-kenobi.jpg?resize=1240,1240&w=300",
      "description": "Though Ewan McGregor put the “wan” in Obi-Wan Kenobi in the prequels, the Jedi Knight personifies the patience, wisdom, and discipline required to harness the Force. Alec Guinness’ well-known contempt for Star Wars aside, his gravitas as “Old Ben” Kenobi in the original film defined what Lucas felt a hero ought to be — a standard for courage and decency that Anakin and Luke Skywalker followed to widely varying degrees of success. For all their faults, the prequels gave the elder statesman for the Force a backstory that legitimately deepens the character, explaining why he’s so cautious in bringing Luke along and why he carries such regret for his failures with Anakin. All that’s missing is a how-to on the “Jedi mind trick.” ST"
    },
    {
      "name": "R2-D2",
      "gender": "Male",
      "height": 109,
      "mass": 32,
      "homeworld": "Naboo",
      "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-218664-7-r2d2-cc3a79ac-5212-4452-852d-27eacea91652.jpg?resize=1240,1240&w=300",
      "description": "While his partner frets, nags, and offers the occasional translation, our favorite compact, diminutive friend bloops and bleeps the gang out of sticky situations. Need a wingman in aerial dogfights against the Imperial Fleet? Bleep-bloop-bleep. Garbage compactor mere seconds away from crushing the heroes of the Rebel Alliance? Bleep-bloop-bloop-bleep. A disembodied, discombobulated C-3PO wriggling on the ground, in need of rescue — again? Bloop-bloop-whistle. R2-D2 gets it the fuck done. The droid can even be outfitted to serve drinks. Along with Yoda, he’s perhaps the only Star Wars character to be a paragon of excellence in both the prequels and the original trilogy, and the surest way out of a jam. Only con: Easily tipped over. ST"
    },
    {
      "name": "Rey",
      "gender": "Female",
      "height": 170,
      "mass": 54,
      "homeworld": "Jakku",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rey.jpg?resize=1240,1240&w=300",
      "description": "Complaints that The Force Awakens‘ desert-dwelling heroine is just too good at everything she does – pilot, mechanic, Force-wielder, lightsaber duelist, escape artist – ignore two important factors. First, her flashbacks indicate that there’s much more to her mysterious past than meets the eye, and we wouldn’t be surprised if long-buried memories of Jedi training were a part of it. Second, breakout star Daisy Ridely is an absolute joy to watch in the role, a magnetic screen presence who nails moments of mirth and melodrama alike. (The same could be said for her franchise warrior-sister Jyn Erso, who feels as if she’s been cut from the same cloth as Rey.) If she’s the Star Wars Universe’s new chosen one, the good folks at Lucasfilm have chosen wisely. STC"
    },
    {
      "name": "Luke Skywalker",
      "gender": "Male",
      "height": 172,
      "mass": 73,
      "homeworld": "Tatooine",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218592-6-luke-cd70ba0f-828e-4231-9c8d-f8d6ab92a07b.jpg?resize=1240,1240&w=300",
      "description": "Han Solo is the bigger badass, but the original trilogy’s actual hero is the franchise’s most stealthily fascinating character. Talk all you like about the Joseph Campbell-style “hero’s journey,” but what makes a restless farmboy such a strong anchor for this space opera is that even after he’s mastered The Force, he still seems like one of us. The pivotal player in a decades-old interplanetary struggle for democracy, Luke is both compassionate and temperamental — and never sure if he’s using his powers the right way. Anyone who thinks of Star Wars as a simplistic story of good and evil needs to look more closely at the young Skywalker, who always seems to be on the brink of turning dark, even when he’s saving the day. NM"
    },
    {
      "name": "Princess Leia",
      "gender": "Female",
      "height": 150,
      "mass": 51,
      "homeworld": "Alderaan",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218591-5-leia-a09cab78-e7a1-4be4-b437-99a1d7d4d280.jpg?resize=1240,1240&w=300",
      "description": "When studio heads pay lip service to the importance of creating “proactive” female protagonists for their blockbusters, it shows how far Hollywood remains behind Lucas’ conception of Princess Leia from almost 40 years ago. Luke and Han may be the central heroes of the original trilogy; it’s Leia, however, who provides its heart, which doesn’t mean she isn’t capable with a blaster. The late, great Carrie Fisher turns her every line of dialogue into a mocking jab, refusing to let the smart, spitfire character settle into simply being a Death Star damsel-in-distress. It’s impossible to erase the fact that she and Luke kiss in the first film (and, er, the second film), but what’s great about her love story with Han in The Empire Strikes Back is that it feels like a relationship of equals, the two strongest-willed people in the galaxy realizing they’re nuts about one another. As for the racy slave number from Return of the Jedi that jump-started a generation of boys’ sexual awakening, just remember she managed to kill Jabba while rocking it. We miss you, Carrie. TG"
    },
    {
      "name": "Yoda",
      "gender": "Male",
      "height": 66,
      "mass": 13,
      "homeworld": "n/a",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218589-4-yoda-6a430ef2-4be5-43d5-8614-e743ca7b2f69.jpg?resize=1240,1240&w=300",
      "description": "Like a lot of good mentors, Yoda doesn’t make things easy on his pupils, expecting them to figure out things on their own rather than spoon-feeding them important life lessons. (How else to explain a character who refuses to speak in the traditional subject-verb order?) Introduced in The Empire Strikes Back, the diminutive Jedi master remains one of the most remarkable non-human characters ever created, one who the Muppeteer Frank Oz immediately connected with. (“[Jim Henson] showed me a sketch of Yoda — and it felt right,” he would later explain. “Sometimes you have to work at something before you have that feeling, but this felt really good.”) By avoiding computer effects, Lucas and his team made Yoda seem as real as Luke, creating a warm father-son rapport between the characters that’s crucial to Empire‘s emotional arc. For the prequels, Lucas went with soulless CGI version: Not a good decision, it was. TG"
    },
    {
      "name": "Boba Fett",
      "gender": "Male",
      "height": 183,
      "mass": 78,
      "homeworld": "Kamino",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218587-3-boba-fett-9dce897b-f605-4fae-9de7-dfbf95ab1a2d.jpg?resize=1240,1240&w=300",
      "description": "Everyone’s favorite intergalactic bounty hunter made his first canonical appearance in The Empire Strikes Back, chasing down Han Solo for Jabba the Hutt. But even before that, Boba Fett was well-known to the Star Wars hardcore, who’d seen the character march in a California parade and pop up in animated form in the notorious Star Wars Holiday Special — both in 1978. Jango’s little boy-clone was a hit before he’d even really done anything on the big screen. And given that he’s barely in the original trilogy, some may wonder why he’s so popular. So we’ll say it again: Intergalactic. Bounty. Hunter. Throw in the armor and the rocket launcher, and it’s no wonder that Lucas felt compelled to make the Fett family so integral to the prequels. Some characters demand to get off the side of the stage and into the thick of the action. NM"
    },
    {
      "name": "Darth Vader",
      "gender": "Male",
      "height": 203,
      "mass": 120,
      "homeworld": "Tatooine",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218586-2-vader-f6cdf838-912c-4bfa-8a12-f43521fbd99c.jpg?resize=1240,1240&w=300",
      "description": "The original trilogy created the impression that the franchise was chronicling Luke Skywalker’s journey from daydreaming teenager to the galaxy-saving Chosen One. But the prequels provocatively shifted that narrative: What if the Star Wars universe is really about the rise, fall and eventual redemption of Luke’s father? Continuing Hollywood’s fascination with origin stories, the second cycle of movies deepened our understanding of the man who would become Darth Vader — showing how an impressionable, slightly snotty kid named Anakin Skywalker discovered his Jedi powers, fell in love with a beautiful princess and was then seduced by the Dark Side. Complain about Jake Lloyd and Hayden Christensen’s bratty performances all you want — and you should, they’re terrible — but that central idea remains potent, and it powerfully informs audiences’ subsequent viewings of the original trilogy. Now, Darth Vader isn’t just a compelling force of evil, one of cinema’s most magnetic villains: He’s a tragic figure crying out to be saved. TG"
    },
    {
      "name": "Han Solo",
      "gender": "Male",
      "height": 180,
      "mass": 80,
      "homeworld": "Corellia",
      "image": "https://www.rollingstone.com/wp-content/uploads/2015/12/rs-218584-1-han-f4c9a887-81df-4c58-b166-94ab4485286b.jpg?resize=1240,1240&w=300",
      "description": [
        "It’s the galaxy’s most notorious response to a proclamation of amore, but Han Solo is far more than a smug swashbuckler. The scoundrel-turned Rebel leader may not be George Lucas’s most unique creation, but the Falcon’s scrappy flyboy is the original trilogy’s most vital asset. Harrison Ford’s classic masculinity and lopsided grin, worn with the casual flair of a man utterly at ease in the galaxy, made him a premiere heartthrob and the lifeblood of the franchise’s holy trinity. Solo is the Western hero, the noir detective, and the hot-rodding rebel rolled into one. He’s a grand patchwork of every movie hero Lucas ever loved, assembled for a new audience."
      ]
    }
  ]
}
